Output from `terraform plan`
```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

github_team.admins: Refreshing state... [id=4263190]
github_team.users: Refreshing state... [id=4263191]
github_repository.this_repository: Refreshing state... [id=fastrobot_demo_github_org]
github_repository.packer_repository: Refreshing state... [id=fastrobot_demo_image_manager]
github_repository.repos["project_c"]: Refreshing state... [id=project_c]
github_repository.repos["project_b"]: Refreshing state... [id=project_b]
github_team_membership.to_admins["lamont"]: Refreshing state... [id=4263190:lamont]
github_team_membership.to_admins["fr-demo-ci"]: Refreshing state... [id=4263190:fr-demo-ci]
github_team_membership.to_admins["jcookfastrobot"]: Refreshing state... [id=4263190:jcookfastrobot]
github_team_membership.to_users["lamont"]: Refreshing state... [id=4263191:lamont]
github_team_membership.to_users["jcookfastrobot"]: Refreshing state... [id=4263191:jcookfastrobot]
github_repository_collaborator.main_collab["jcookfastrobot"]: Refreshing state... [id=fastrobot_demo_github_org:jcookfastrobot]
github_repository_collaborator.main_collab["lamont"]: Refreshing state... [id=fastrobot_demo_github_org:lamont]
github_repository_collaborator.main_collab["fr-demo-ci"]: Refreshing state... [id=fastrobot_demo_github_org:fr-demo-ci]
github_branch_protection.this_repository_branch_protection: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgyMzc2NDU=]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.this_repository_branch_protection will be updated in-place
  ~ resource "github_branch_protection" "this_repository_branch_protection" {
        enforce_admins         = true
        id                     = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTgyMzc2NDU="
        pattern                = "main"
      ~ push_restrictions      = [
          + "MDQ6VGVhbTQyNjMxOTA=",
          + "MDQ6VGVhbTQyNjMxOTE=",
        ]
        repository_id          = "MDEwOlJlcG9zaXRvcnkzMDk4MTk5NTc="
        require_signed_commits = false
    }

  # github_repository.repos["project_d"] will be created
  + resource "github_repository" "repos" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = "main"
      + delete_branch_on_merge = false
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "project_d"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

```